---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidOrderOfPhases
source: html/c76ae921-081f-2de2-adab-30926c906a79.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidOrderOfPhases Property

Invalid order of phases: [Type Name] cannot be demolished before it was created.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidOrderOfPhases { get; }
```